bench/results/10000_db.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/rank_ab.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 25s max duration (incl. graceful stop):
              * rank_ab: 30 looping VUs for 20s (gracefulStop: 5s)


running (01.0s), 30/30 VUs, 46 complete and 0 interrupted iterations
rank_ab   [   5% ] 30 VUs  01.0s/20s

running (02.0s), 30/30 VUs, 69 complete and 0 interrupted iterations
rank_ab   [  10% ] 30 VUs  02.0s/20s

running (03.0s), 30/30 VUs, 95 complete and 0 interrupted iterations
rank_ab   [  15% ] 30 VUs  03.0s/20s

running (04.0s), 30/30 VUs, 121 complete and 0 interrupted iterations
rank_ab   [  20% ] 30 VUs  04.0s/20s

running (05.0s), 30/30 VUs, 148 complete and 0 interrupted iterations
rank_ab   [  25% ] 30 VUs  05.0s/20s

running (06.0s), 30/30 VUs, 182 complete and 0 interrupted iterations
rank_ab   [  30% ] 30 VUs  06.0s/20s

running (07.0s), 30/30 VUs, 208 complete and 0 interrupted iterations
rank_ab   [  35% ] 30 VUs  07.0s/20s

running (08.0s), 30/30 VUs, 237 complete and 0 interrupted iterations
rank_ab   [  40% ] 30 VUs  08.0s/20s

running (09.0s), 30/30 VUs, 262 complete and 0 interrupted iterations
rank_ab   [  45% ] 30 VUs  09.0s/20s

running (10.0s), 30/30 VUs, 302 complete and 0 interrupted iterations
rank_ab   [  50% ] 30 VUs  10.0s/20s

running (11.0s), 30/30 VUs, 345 complete and 0 interrupted iterations
rank_ab   [  55% ] 30 VUs  11.0s/20s

running (12.0s), 30/30 VUs, 386 complete and 0 interrupted iterations
rank_ab   [  60% ] 30 VUs  12.0s/20s

running (13.0s), 30/30 VUs, 429 complete and 0 interrupted iterations
rank_ab   [  65% ] 30 VUs  13.0s/20s

running (14.0s), 30/30 VUs, 467 complete and 0 interrupted iterations
rank_ab   [  70% ] 30 VUs  14.0s/20s

running (15.0s), 30/30 VUs, 506 complete and 0 interrupted iterations
rank_ab   [  75% ] 30 VUs  15.0s/20s

running (16.0s), 30/30 VUs, 548 complete and 0 interrupted iterations
rank_ab   [  80% ] 30 VUs  16.0s/20s

running (17.0s), 30/30 VUs, 589 complete and 0 interrupted iterations
rank_ab   [  85% ] 30 VUs  17.0s/20s

running (18.0s), 30/30 VUs, 627 complete and 0 interrupted iterations
rank_ab   [  90% ] 30 VUs  18.0s/20s

running (19.0s), 30/30 VUs, 656 complete and 0 interrupted iterations
rank_ab   [  95% ] 30 VUs  19.0s/20s

running (20.0s), 30/30 VUs, 690 complete and 0 interrupted iterations
rank_ab   [ 100% ] 30 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......: 720     34.915774/s
    checks_succeeded...: 100.00% 720 out of 720
    checks_failed......: 0.00%   0 out of 720

    ✓ top30 200
    ✓ user_rank 200

    CUSTOM
    top30_latency..................: avg=785.75ms min=108.22ms med=757.67ms max=1.88s p(90)=1.15s p(95)=1.28s
    user_rank_latency..............: avg=972.7ms  min=160.87ms med=927.84ms max=1.82s p(90)=1.43s p(95)=1.54s

    HTTP
    http_req_duration..............: avg=846.77ms min=108.22ms med=808.58ms max=1.88s p(90)=1.26s p(95)=1.42s
      { expected_response:true }...: avg=846.77ms min=108.22ms med=808.58ms max=1.88s p(90)=1.26s p(95)=1.42s
    http_req_failed................: 0.00%  0 out of 720
    http_reqs......................: 720    34.915774/s

    EXECUTION
    iteration_duration.............: avg=847.35ms min=117.55ms med=808.79ms max=1.88s p(90)=1.26s p(95)=1.42s
    iterations.....................: 720    34.915774/s
    vus............................: 30     min=30       max=30
    vus_max........................: 30     min=30       max=30

    NETWORK
    data_received..................: 865 kB 42 kB/s
    data_sent......................: 58 kB  2.8 kB/s



running (20.6s), 00/30 VUs, 720 complete and 0 interrupted iterations
rank_ab ✓ [ 100% ] 30 VUs  20s